Practica 2 Procesamiento de datos
--

# 1.Importar librerias
--

In [1]:
!pip install numpy
!pip install pandas
!pip install seaborn
!pip install matplotlib
!pip install pandas_profiling

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\programdata\anaconda3\lib\site-packages (1.26.4)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: seaborn in c:\programdata\anaconda3\lib\site-packages (0.12.2)
Requirement already satisfied: numpy!=1.24.0,>=1.17 in c:\programdata\anaconda3\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=0.25 in c:\programdata\anaconda3\lib\site-packages (from seaborn) (2.1.4)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in c:\programdata\anaconda3\lib\site-packages (from seaborn) (3.8.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\programdata\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.25->seaborn) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.25->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: matplotlib in c:\programdata\anaconda3\lib\site-packages (3.8.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: numpy<2,>=1.21 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\programdata\anaconda3\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas_profiling in c:\users\multimedia\appdata\roaming\python\python311\site-packages (3.2.0)
Requirement already satisfied: joblib~=1.1.0 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from pandas_profiling) (1.1.1)
Requirement already satisfied: scipy>=1.4.1 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (1.11.4)
Requirement already satisfied: pandas!=1.0.0,!=1.0.1,!=1.0.2,!=1.1.0,>=0.25.3 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (2.1.4)
Requirement already satisfied: matplotlib>=3.2.0 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (3.8.0)
Requirement already satisfied: pydantic>=1.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (1.10.12)
Requirement already satisfied: PyYAML>=5.0.0 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (6.0.1)
Requirement already satisfied: jinja2>=2.11.1 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (3.1.3)
Requirement already satisfied: markupsafe~=2.1.1 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (2.1.3)
Requirement already satisfied: visions==0.7.4 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from visions[type_image_path]==0.7.4->pandas_profiling) (0.7.4)
Requirement already satisfied: numpy>=1.16.0 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (1.26.4)
Requirement already satisfied: htmlmin>=0.1.12 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from pandas_profiling) (0.1.12)
Requirement already satisfied: missingno>=0.4.2 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from pandas_profiling) (0.5.2)
Requirement already satisfied: phik>=0.11.1 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from pandas_profiling) (0.12.4)
Requirement already satisfied: tangled-up-in-unicode==0.2.0 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from pandas_profiling) (0.2.0)
Requirement already satisfied: requests>=2.24.0 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (2.31.0)
Requirement already satisfied: tqdm>=4.48.2 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (4.65.0)
Requirement already satisfied: seaborn>=0.10.1 in c:\programdata\anaconda3\lib\site-packages (from pandas_profiling) (0.12.2)
Requirement already satisfied: multimethod>=1.4 in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from pandas_profiling) (1.11.2)
Requirement already satisfied: attrs>=19.3.0 in c:\programdata\anaconda3\lib\site-packages (from visions==0.7.4->visions[type_image_path]==0.7.4->pandas_profiling) (23.1.0)
Requirement already satisfied: networkx>=2.4 in c:\programdata\anaconda3\lib\site-packages (from visions==0.7.4->visions[type_image_path]==0.7.4->pandas_profiling) (3.1)
Requirement already satisfied: imagehash in c:\users\multimedia\appdata\roaming\python\python311\site-packages (from visions[type_image_path]==0.7.4->pandas_profiling) (4.3.1)
Requirement already satisfied: Pillow in c:\programdata\anaconda3\lib\site-packages (from visions[type_image_path]==0.7.4->pandas_profiling) (10.2.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (23.1)
Requirement already satisfied: pyparsing>=2.3.1 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\programdata\anaconda3\lib\site-packages (from matplotlib>=3.2.0->pandas_profiling) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas!=1.0.0,!=1.0.1,!=1.0.2,!=1.1.0,>=0.25.3->pandas_profiling) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas!=1.0.0,!=1.0.1,!=1.0.2,!=1.1.0,>=0.25.3->pandas_profiling) (2023.3)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\programdata\anaconda3\lib\site-packages (from pydantic>=1.8.1->pandas_profiling) (4.9.0)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.24.0->pandas_profiling) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.24.0->pandas_profiling) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.24.0->pandas_profiling) (2.0.7)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.24.0->pandas_profiling) (2024.2.2)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from tqdm>=4.48.2->pandas_profiling) (0.4.6)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=3.2.0->pandas_profiling) (1.16.0)
Requirement already satisfied: PyWavelets in c:\programdata\anaconda3\lib\site-packages (from imagehash->visions[type_image_path]==0.7.4->pandas_profiling) (1.5.0)

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder

In [3]:
df= pd.read_csv('DataScientist.csv')
df.head()

,Unnamed: 0,index,Job Title,Job Description,Rating,Company Name,Founded,Type of ownership,Industry,Sector,...,Location City,Location State,Headquarters City,Headquarters State,Minimum Revenue,Maximum Revenue,Minimum Size,Maximum Size,Average Revenue,Average Salary
0,0,0,Senior Data Scientist,"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...",3.5,Hopper\n3.5,2007.0,Company - Private,Travel Agencies,Travel & Tourism,...,New York,NY,Montreal,Canada,NaN,NaN,501.0,1000.0,NaN,146.0
1,1,1,Data Scientist,"At Noom, we use scientifically proven methods ...",4.5,Noom US\n4.5,2008.0,Company - Private,"Health, Beauty, & Fitness",Consumer Services,...,New York,NY,New York,NY,NaN,NaN,1001.0,5000.0,NaN,146.0
2,2,2,Data Science Manager,Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,NaN,Decode_M,NaN,Unknown,NaN,NaN,...,New York,NY,New York,NY,NaN,NaN,1.0,50.0,NaN,146.0
3,3,3,Data Analyst,Sapphire Digital seeks a dynamic and driven mi...,3.4,Sapphire Digital\n3.4,2019.0,Company - Private,Internet,Information Technology,...,Lyndhurst,NJ,Lyndhurst,NJ,NaN,NaN,201.0,500.0,NaN,146.0
4,4,4,Director,"Director, Data Science - (200537)\nDescription...",3.4,United Entertainment Group\n3.4,2007.0,Company - Private,Advertising & Marketing,Business Services,...,New York,NY,New York,NY,NaN,NaN,51.0,200.0,NaN,146.0

2.2 Seleccionar datos
--

In [4]:
df.columns

Index(['Unnamed: 0', 'index', 'Job Title', 'Job Description', 'Rating',
       'Company Name', 'Founded', 'Type of ownership', 'Industry', 'Sector',
       'Competitors', 'Easy Apply', 'Minimum Salary', 'Maximum Salary',
       'Est_Salary', 'Location City', 'Location State', 'Headquarters City',
       'Headquarters State', 'Minimum Revenue', 'Maximum Revenue',
       'Minimum Size', 'Maximum Size', 'Average Revenue', 'Average Salary'],
      dtype='object')

In [5]:
df = df[['Job Title', 'Rating',
        'Type of ownership', 'Sector',
        'Easy Apply',
        'Location State',
        'Average Revenue', 'Average Salary']]
df.head()

,Job Title,Rating,Type of ownership,Sector,Easy Apply,Location State,Average Revenue,Average Salary
0,Senior Data Scientist,3.5,Company - Private,Travel & Tourism,True,NY,NaN,146.0
1,Data Scientist,4.5,Company - Private,Consumer Services,True,NY,NaN,146.0
2,Data Science Manager,NaN,Unknown,NaN,True,NY,NaN,146.0
3,Data Analyst,3.4,Company - Private,Information Technology,True,NJ,NaN,146.0
4,Director,3.4,Company - Private,Business Services,True,NY,NaN,146.0

2.3 Renombrar columnas
--

In [6]:
df.columns = ['cargo', 'rating', 'tipo', 'sector', 'aplicacion', 'estado', 'ingreso', 'salario']
df.head()

,cargo,rating,tipo,sector,aplicacion,estado,ingreso,salario
0,Senior Data Scientist,3.5,Company - Private,Travel & Tourism,True,NY,NaN,146.0
1,Data Scientist,4.5,Company - Private,Consumer Services,True,NY,NaN,146.0
2,Data Science Manager,NaN,Unknown,NaN,True,NY,NaN,146.0
3,Data Analyst,3.4,Company - Private,Information Technology,True,NJ,NaN,146.0
4,Director,3.4,Company - Private,Business Services,True,NY,NaN,146.0

# 3. Limpieza de datos

# Consultar si hay datos perdidos
df.isnull().any()

In [7]:
#Consultar cuantos datos perdidos por columna hay
df.isnull().sum()

cargo            0
rating         409
tipo           229
sector         546
aplicacion       0
estado           0
ingreso       1392
salario          0
dtype: int64

In [8]:
df.shape

(3909, 8)

# 3.1 Eliminar todos los registros perdidos

In [9]:
df1 = df.dropna(axis=0) #0 = columnas
df1.shape

(2417, 8)

In [10]:
df1.isnull().sum()

cargo         0
rating        0
tipo          0
sector        0
aplicacion    0
estado        0
ingreso       0
salario       0
dtype: int64

### 3.2 Eliminar todas las columnas con registros pérdidos

In [11]:
df2 = df.dropna(axis=1) # 1 = FIlas
df2.head()

                   cargo  aplicacion estado  salario
0  Senior Data Scientist        True     NY    146.0
1         Data Scientist        True     NY    146.0
2   Data Science Manager        True     NY    146.0
3           Data Analyst        True     NJ    146.0
4               Director        True     NY    146.0

### 3.3 Eliminar columnas seleccionadas con valores perdidos

In [12]:
df3 = df.dropna(subset=['ingreso'],axis=0)
df3.shape

(2517, 8)

### 3.4 Reemplazar registros perdidos con media

In [13]:
df.dtypes

cargo          object
rating        float64
tipo           object
sector         object
aplicacion       bool
estado         object
ingreso       float64
salario       float64
dtype: object

In [14]:
PromRating = df['rating'].mean()
print(PromRating)

3.7841428571428573

In [15]:
PromIngreso = df['ingreso'].mean()
print(PromIngreso)

3212.7133492252683

In [16]:
df['rating'] = df['rating'].replace(np.nan, PromRating)
df['ingreso'] = df['ingreso'].replace(np.nan, PromIngreso)
df.head()

,cargo,rating,tipo,sector,aplicacion,estado,ingreso,salario
0,Senior Data Scientist,3.500000,Company - Private,Travel & Tourism,True,NY,3212.713349,146.0
1,Data Scientist,4.500000,Company - Private,Consumer Services,True,NY,3212.713349,146.0
2,Data Science Manager,3.784143,Unknown,NaN,True,NY,3212.713349,146.0
3,Data Analyst,3.400000,Company - Private,Information Technology,True,NJ,3212.713349,146.0
4,Director,3.400000,Company - Private,Business Services,True,NY,3212.713349,146.0

### 3.5 Remplazar registros perdidos en columnas categoricas con moda

In [17]:
ModaTipo = df['tipo'].mode()
print(ModaTipo)

ModaSector = df['sector'].mode()
print(ModaSector)

0    Company - Private
Name: tipo, dtype: object
0    Information Technology
Name: sector, dtype: object

In [18]:
df['tipo'] = df['tipo'].fillna('Company - Private')
df['sector'] = df ['sector'].fillna('Information Technology')

df.isnull().sum()

cargo         0
rating        0
tipo          0
sector        0
aplicacion    0
estado        0
ingreso       0
salario       0
dtype: int64

## 4. Transformación de datos

In [19]:
df.dtypes

cargo          object
rating        float64
tipo           object
sector         object
aplicacion       bool
estado         object
ingreso       float64
salario       float64
dtype: object

In [24]:
encoder = preprocessing.LabelEncoder()
encoder.fit(df['cargo'])
df['cargo'] = encoder.transform(df['cargo'])

df.head()

,cargo,rating,tipo,sector,aplicacion,estado,ingreso,salario
0,1509,3.500000,Company - Private,Travel & Tourism,True,NY,3212.713349,146.0
1,601,4.500000,Company - Private,Consumer Services,True,NY,3212.713349,146.0
2,582,3.784143,Unknown,Informacion Technology,True,NY,3212.713349,146.0
3,344,3.400000,Company - Private,Information Technology,True,NJ,3212.713349,146.0
4,769,3.400000,Company - Private,Business Services,True,NY,3212.713349,146.0

In [28]:
ObjList = df.select_dtypes(include = ('object', 'bool')).columns
print(ObjList)

Index(['tipo', 'sector', 'aplicacion', 'estado'], dtype='object')

In [32]:
for feat in ObjList:
    df[feat] = encoder.fit_transform(df[feat]).astype(str)
df.head()

   cargo    rating tipo sector aplicacion estado      ingreso  salario
0   1509  3.500000    1     10          0      8  3212.713349    146.0
1    601  4.500000    1     16          0      8  3212.713349    146.0
2    582  3.784143    9     20          0      8  3212.713349    146.0
3    344  3.400000    1     21          0      7  3212.713349    146.0
4    769  3.400000    1     14          0      8  3212.713349    146.0

## 5. Eliminar duplicados

In [33]:
#Buscar duplicado
df.duplicated().any()

True

In [41]:
df.duplicated().sum()

56

In [42]:
#Eliminar duplicados
df_sinduplicados = df.drop_duplicates(keep='last')
print(df_sinduplicados)

      cargo    rating tipo sector aplicacion estado      ingreso  salario
0      1509  3.500000    1     10          0      8  3212.713349    146.0
1       601  4.500000    1     16          0      8  3212.713349    146.0
2       582  3.784143    9     20          0      8  3212.713349    146.0
3       344  3.400000    1     21          0      7  3212.713349    146.0
4       769  3.400000    1     14          0      8  3212.713349    146.0
...     ...       ...  ...    ...        ...    ...          ...      ...
3904     38  4.400000    1     21          0      9    17.500000     83.5
3905    419  5.000000    1     21          0      9    75.000000     83.5
3906   1425  3.800000    1     14          0      9   300.000000     83.5
3907   1425  4.000000    1      0          0      9     0.500000     83.5
3908   1130  3.700000   10     13          0      9  3500.000000     83.5

[3853 rows x 8 columns]

In [43]:
df_sinduplicados.shape

(3853, 8)